# VS Code extensions — one id per line. Installed via `code --install-extension`.
# Lines starting with # are ignored.

# Theme + icons (matches the starship Catppuccin palette)
catppuccin.catppuccin-vsc
catppuccin.catppuccin-vsc-icons

# Git
eamodio.gitlens

# Formatting / linting
esbenp.prettier-vscode
dbaeumer.vscode-eslint
editorconfig.editorconfig

# Languages
ms-python.python
ms-python.black-formatter
rust-lang.rust-analyzer
golang.go
redhat.vscode-yaml
tamasfe.even-better-toml

# Containers / remote
ms-azuretools.vscode-docker
ms-vscode-remote.remote-ssh
